# pivot_table

In [12]:
import pydataset

In [13]:
tips = pydataset.data('tips')
tips

     total_bill   tip     sex smoker   day    time  size
1         16.99  1.01  Female     No   Sun  Dinner     2
2         10.34  1.66    Male     No   Sun  Dinner     3
3         21.01  3.50    Male     No   Sun  Dinner     3
4         23.68  3.31    Male     No   Sun  Dinner     2
5         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
240       29.03  5.92    Male     No   Sat  Dinner     3
241       27.18  2.00  Female    Yes   Sat  Dinner     2
242       22.67  2.00    Male    Yes   Sat  Dinner     2
243       17.82  1.75    Male     No   Sat  Dinner     2
244       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [14]:
tips['tip_pct']=tips['tip']/(tips['total_bill']-tips['tip'])
tips

     total_bill   tip     sex smoker   day    time  size   tip_pct
1         16.99  1.01  Female     No   Sun  Dinner     2  0.063204
2         10.34  1.66    Male     No   Sun  Dinner     3  0.191244
3         21.01  3.50    Male     No   Sun  Dinner     3  0.199886
4         23.68  3.31    Male     No   Sun  Dinner     2  0.162494
5         24.59  3.61  Female     No   Sun  Dinner     4  0.172069
..          ...   ...     ...    ...   ...     ...   ...       ...
240       29.03  5.92    Male     No   Sat  Dinner     3  0.256166
241       27.18  2.00  Female    Yes   Sat  Dinner     2  0.079428
242       22.67  2.00    Male    Yes   Sat  Dinner     2  0.096759
243       17.82  1.75    Male     No   Sat  Dinner     2  0.108899
244       18.78  3.00  Female     No  Thur  Dinner     2  0.190114

[244 rows x 8 columns]

In [15]:
tips.groupby(['day', 'smoker']).agg('mean')

             total_bill       tip      size   tip_pct
day  smoker
Fri  No       18.420000  2.812500  2.250000  0.179740
     Yes      16.813333  2.714000  2.066667  0.216293
Sat  No       19.661778  3.102889  2.555556  0.190412
     Yes      21.276667  2.875476  2.476190  0.179833
Sun  No       20.506667  3.167895  2.929825  0.193617
     Yes      24.120000  3.516842  2.578947  0.322021
Thur No       17.113111  2.673778  2.488889  0.193424
     Yes      19.190588  3.030000  2.352941  0.198508

In [16]:
#위와 같다
tips.pivot_table(index = ['day','smoker'])

                 size       tip   tip_pct  total_bill
day  smoker
Fri  No      2.250000  2.812500  0.179740   18.420000
     Yes     2.066667  2.714000  0.216293   16.813333
Sat  No      2.555556  3.102889  0.190412   19.661778
     Yes     2.476190  2.875476  0.179833   21.276667
Sun  No      2.929825  3.167895  0.193617   20.506667
     Yes     2.578947  3.516842  0.322021   24.120000
Thur No      2.488889  2.673778  0.193424   17.113111
     Yes     2.352941  3.030000  0.198508   19.190588

In [17]:
tips.pivot_table(index = 'time', columns = 'smoker')

            size                 tip             tip_pct           total_bill  \
smoker        No       Yes        No       Yes        No       Yes         No
time
Dinner  2.735849  2.471429  3.126887  3.066000  0.191346  0.221347  20.095660
Lunch   2.511111  2.217391  2.673778  2.834348  0.194335  0.208527  17.050889


smoker        Yes
time
Dinner  21.859429
Lunch   17.399130

In [18]:
tips.pivot_table(index = 'time', columns = 'smoker', values = 'tip_pct')

smoker        No       Yes
time
Dinner  0.191346  0.221347
Lunch   0.194335  0.208527

In [19]:
tips.pivot_table(index = ['day','time'], columns = 'smoker', values = ['tip_pct','size'])

                 size             tip_pct
smoker             No       Yes        No       Yes
day  time
Fri  Dinner  2.000000  2.222222  0.162612  0.202545
     Lunch   3.000000  1.833333  0.231125  0.236915
Sat  Dinner  2.555556  2.476190  0.190412  0.179833
Sun  Dinner  2.929825  2.578947  0.193617  0.322021
Thur Dinner  2.000000       NaN  0.190114       NaN
     Lunch   2.500000  2.352941  0.193499  0.198508

## margin
- 그룹 전체 평균

In [20]:
tips.pivot_table(index = 'time', columns = 'smoker', values = 'tip_pct', margins = True)

smoker        No       Yes       All
time
Dinner  0.191346  0.221347  0.203278
Lunch   0.194335  0.208527  0.199135
All     0.192237  0.218176  0.202123

In [21]:
tips.pivot_table(index = ['day','time'], columns = 'smoker', values = ['tip_pct', 'size'], margins = True)

                 size                       tip_pct
smoker             No       Yes       All        No       Yes       All
day  time
Fri  Dinner  2.000000  2.222222  2.166667  0.162612  0.202545  0.192562
     Lunch   3.000000  1.833333  2.000000  0.231125  0.236915  0.236088
Sat  Dinner  2.555556  2.476190  2.517241  0.190412  0.179833  0.185305
Sun  Dinner  2.929825  2.578947  2.842105  0.193617  0.322021  0.225718
Thur Dinner  2.000000       NaN  2.000000  0.190114       NaN  0.190114
     Lunch   2.500000  2.352941  2.459016  0.193499  0.198508  0.194895
All          2.668874  2.408602  2.569672  0.192237  0.218176  0.202123

## aggfunc

In [22]:
tips.pivot_table(index = ['time','day'], columns = 'smoker', values = 'tip_pct', margins = True, aggfunc = 'count')

smoker          No   Yes  All
time   day
Dinner Fri     3.0   9.0   12
       Sat    45.0  42.0   87
       Sun    57.0  19.0   76
       Thur    1.0   NaN    1
Lunch  Fri     1.0   6.0    7
       Thur   44.0  17.0   61
All          151.0  93.0  244

In [23]:
tips.pivot_table(index = ['time','day'], columns = 'smoker', values = 'tip_pct', margins = True, aggfunc = 'sum')

smoker              No        Yes        All
time   day
Dinner Fri    0.487836   1.822904   2.310740
       Sat    8.568545   7.552972  16.121517
       Sun   11.036159   6.118397  17.154556
       Thur   0.190114        NaN   0.190114
Lunch  Fri    0.231125   1.421491   1.652616
       Thur   8.513958   3.374631  11.888589
All          29.027737  20.290395  49.318132

# crosstab

In [3]:
import pandas as pd

In [25]:
pd.crosstab(index = tips.time, columns = tips.smoker)

smoker   No  Yes
time
Dinner  106   70
Lunch    45   23

In [26]:
pd.crosstab(index = [tips.time, tips.day], columns = tips.smoker, margins=True)

smoker        No  Yes  All
time   day
Dinner Fri     3    9   12
       Sat    45   42   87
       Sun    57   19   76
       Thur    1    0    1
Lunch  Fri     1    6    7
       Thur   44   17   61
All          151   93  244

# datetime

In [4]:
from datetime import datetime

In [28]:
datetime.now()

datetime.datetime(2022, 10, 5, 9, 6, 40, 486693)

In [29]:
now = datetime.now()
print(now.year)
print(now.month)
print(now.second)
now

2022
10
40

datetime.datetime(2022, 10, 5, 9, 6, 40, 661565)

In [30]:
christmas = datetime(2022,12,25)
christmas - now

datetime.timedelta(days=80, seconds=53599, microseconds=338435)

In [31]:
#time을 문자열로
now.strftime('%Y-%m-%d-%H-%M')

'2022-10-05-09-06'

In [32]:
#문자열을 datatime으로
datetime.strptime('2022-10-04-9-9', '%Y-%m-%d-%H-%M')

datetime.datetime(2022, 10, 4, 9, 9)

# date_range

In [33]:
pd.date_range('1/30/2000', periods = 10)

DatetimeIndex(['2000-01-30', '2000-01-31', '2000-02-01', '2000-02-02',
               '2000-02-03', '2000-02-04', '2000-02-05', '2000-02-06',
               '2000-02-07', '2000-02-08'],
              dtype='datetime64[ns]', freq='D')

In [34]:
pd.date_range('1/30/2000', '3/1/2000', periods = 10)

DatetimeIndex(['2000-01-30 00:00:00', '2000-02-02 10:40:00',
               '2000-02-05 21:20:00', '2000-02-09 08:00:00',
               '2000-02-12 18:40:00', '2000-02-16 05:20:00',
               '2000-02-19 16:00:00', '2000-02-23 02:40:00',
               '2000-02-26 13:20:00', '2000-03-01 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [35]:
pd.date_range('1/1/2000', '2/1/2000', freq = '5H')

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 05:00:00',
               '2000-01-01 10:00:00', '2000-01-01 15:00:00',
               '2000-01-01 20:00:00', '2000-01-02 01:00:00',
               '2000-01-02 06:00:00', '2000-01-02 11:00:00',
               '2000-01-02 16:00:00', '2000-01-02 21:00:00',
               ...
               '2000-01-29 23:00:00', '2000-01-30 04:00:00',
               '2000-01-30 09:00:00', '2000-01-30 14:00:00',
               '2000-01-30 19:00:00', '2000-01-31 00:00:00',
               '2000-01-31 05:00:00', '2000-01-31 10:00:00',
               '2000-01-31 15:00:00', '2000-01-31 20:00:00'],
              dtype='datetime64[ns]', length=149, freq='5H')

In [46]:
dates = pd.date_range('1/30/2000', freq = '3D', periods = 10)
dates

DatetimeIndex(['2000-01-30', '2000-02-02', '2000-02-05', '2000-02-08',
               '2000-02-11', '2000-02-14', '2000-02-17', '2000-02-20',
               '2000-02-23', '2000-02-26'],
              dtype='datetime64[ns]', freq='3D')

# Time Series

In [8]:
import numpy as np

In [48]:
ts = pd.Series(np.random.randint(10), index = dates)
ts

2000-01-30    3
2000-02-02    3
2000-02-05    3
2000-02-08    3
2000-02-11    3
2000-02-14    3
2000-02-17    3
2000-02-20    3
2000-02-23    3
2000-02-26    3
Freq: 3D, dtype: int64

In [49]:
ts[2]

3

In [50]:
ts[0:4:2]

2000-01-30    3
2000-02-05    3
Freq: 6D, dtype: int64

In [51]:
ts + ts[0:4:2]

2000-01-30    6.0
2000-02-02    NaN
2000-02-05    6.0
2000-02-08    NaN
2000-02-11    NaN
2000-02-14    NaN
2000-02-17    NaN
2000-02-20    NaN
2000-02-23    NaN
2000-02-26    NaN
dtype: float64

In [52]:
long_ts = pd.Series(np.random.randn(1000), index = pd.date_range('1/1/2000', freq = '1D', periods = 1000))
long_ts

2000-01-01   -0.499270
2000-01-02    0.726034
2000-01-03    1.722926
2000-01-04   -0.191779
2000-01-05   -1.101040
                ...
2002-09-22   -0.162136
2002-09-23    0.618203
2002-09-24   -0.064665
2002-09-25   -1.741233
2002-09-26   -0.904386
Freq: D, Length: 1000, dtype: float64

In [53]:
long_ts['2001-05']

2001-05-01   -0.719575
2001-05-02   -1.838406
2001-05-03    0.216416
2001-05-04   -0.089921
2001-05-05    0.165126
2001-05-06    0.068116
2001-05-07    0.265398
2001-05-08   -1.625501
2001-05-09    1.204334
2001-05-10    0.406987
2001-05-11    1.404931
2001-05-12   -1.689200
2001-05-13    1.879500
2001-05-14   -0.284052
2001-05-15   -0.082995
2001-05-16   -1.235891
2001-05-17    0.809366
2001-05-18   -0.101556
2001-05-19    0.834158
2001-05-20   -0.329848
2001-05-21    1.177662
2001-05-22   -0.596350
2001-05-23    1.301493
2001-05-24    0.135345
2001-05-25   -0.266744
2001-05-26    1.622923
2001-05-27   -0.338448
2001-05-28   -0.879101
2001-05-29    1.091530
2001-05-30   -0.352826
2001-05-31   -1.245688
Freq: D, dtype: float64

In [55]:
long_ts['2002-09-10':]

2002-09-10    0.156973
2002-09-11    0.365586
2002-09-12    0.816079
2002-09-13   -1.100522
2002-09-14    1.007374
2002-09-15    0.535090
2002-09-16   -1.881768
2002-09-17   -0.379163
2002-09-18   -0.147439
2002-09-19    0.985613
2002-09-20   -0.674690
2002-09-21    1.061425
2002-09-22   -0.162136
2002-09-23    0.618203
2002-09-24   -0.064665
2002-09-25   -1.741233
2002-09-26   -0.904386
Freq: D, dtype: float64

In [56]:
long_ts.truncate(before = '2002-01')

2002-01-01    0.683021
2002-01-02    0.092786
2002-01-03   -0.184115
2002-01-04    0.280474
2002-01-05   -0.109045
                ...
2002-09-22   -0.162136
2002-09-23    0.618203
2002-09-24   -0.064665
2002-09-25   -1.741233
2002-09-26   -0.904386
Freq: D, Length: 269, dtype: float64

In [57]:
df = pd.DataFrame(long_ts)
df

                   0
2000-01-01 -0.499270
2000-01-02  0.726034
2000-01-03  1.722926
2000-01-04 -0.191779
2000-01-05 -1.101040
...              ...
2002-09-22 -0.162136
2002-09-23  0.618203
2002-09-24 -0.064665
2002-09-25 -1.741233
2002-09-26 -0.904386

[1000 rows x 1 columns]

In [63]:
df.loc['2002-05-01',0]

0.25900789197298724

In [64]:
df.loc['2002-05']

                   0
2002-05-01  0.259008
2002-05-02 -1.098630
2002-05-03  0.539382
2002-05-04 -1.007022
2002-05-05  0.243300
2002-05-06 -0.362021
2002-05-07  0.624467
2002-05-08 -0.154647
2002-05-09 -0.415759
2002-05-10 -0.421112
2002-05-11 -0.855302
2002-05-12 -0.173442
2002-05-13  1.455511
2002-05-14 -0.784244
2002-05-15 -1.057349
2002-05-16 -0.600139
2002-05-17  0.278217
2002-05-18 -0.086609
2002-05-19  1.701648
2002-05-20 -0.230809
2002-05-21  1.229610
2002-05-22 -0.621217
2002-05-23 -1.730043
2002-05-24  0.619671
2002-05-25 -0.816825
2002-05-26  0.070546
2002-05-27  0.480816
2002-05-28 -0.071255
2002-05-29  1.652428
2002-05-30  0.760291
2002-05-31 -0.301024

In [75]:
dates = pd.DatetimeIndex(['1/1/2000', '1/2/2000', '1/2/2000', '1/2/2000', '1/3/2000'])
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-02', '2000-01-02',
               '2000-01-03'],
              dtype='datetime64[ns]', freq=None)

In [76]:
ts = pd.Series(np.arange(5), index = dates)
ts

2000-01-01    0
2000-01-02    1
2000-01-02    2
2000-01-02    3
2000-01-03    4
dtype: int32

In [77]:
ts.groupby(level = 0).mean()

2000-01-01    0.0
2000-01-02    2.0
2000-01-03    4.0
dtype: float64

In [82]:
df = pd.DataFrame(ts)
df

            0
2000-01-01  0
2000-01-02  1
2000-01-02  2
2000-01-02  3
2000-01-03  4

In [84]:
df = df.reset_index()
df

       index  0
0 2000-01-01  0
1 2000-01-02  1
2 2000-01-02  2
3 2000-01-02  3
4 2000-01-03  4

In [85]:
df.groupby('index').mean()

              0
index
2000-01-01  0.0
2000-01-02  2.0
2000-01-03  4.0

In [108]:
ts = pd.Series(np.random.randn(5), index=pd.date_range('1/1/2000', periods=5, freq='M'))
ts

2000-01-31    0.399756
2000-02-29    1.111377
2000-03-31   -0.358127
2000-04-30   -1.391653
2000-05-31   -0.424613
Freq: M, dtype: float64

In [112]:
ts.shift(-1)

2000-01-31    1.111377
2000-02-29   -0.358127
2000-03-31   -1.391653
2000-04-30   -0.424613
2000-05-31         NaN
Freq: M, dtype: float64

In [113]:
ts.shift(2)

2000-01-31         NaN
2000-02-29         NaN
2000-03-31    0.399756
2000-04-30    1.111377
2000-05-31   -0.358127
Freq: M, dtype: float64

In [116]:
#이전달과의 변화율
ts/ts.shift(-1)

2000-01-31    0.359694
2000-02-29   -3.103302
2000-03-31    0.257340
2000-04-30    3.277462
2000-05-31         NaN
Freq: M, dtype: float64

In [5]:
ts = pd.date_range('3-21-2012 9:30', periods = 10)
ts

DatetimeIndex(['2012-03-21 09:30:00', '2012-03-22 09:30:00',
               '2012-03-23 09:30:00', '2012-03-24 09:30:00',
               '2012-03-25 09:30:00', '2012-03-26 09:30:00',
               '2012-03-27 09:30:00', '2012-03-28 09:30:00',
               '2012-03-29 09:30:00', '2012-03-30 09:30:00'],
              dtype='datetime64[ns]', freq='D')

In [127]:
ts = ts.tz_localize('utc')
ts

DatetimeIndex(['2012-03-21 09:30:00+00:00', '2012-03-22 09:30:00+00:00',
               '2012-03-23 09:30:00+00:00', '2012-03-24 09:30:00+00:00',
               '2012-03-25 09:30:00+00:00', '2012-03-26 09:30:00+00:00',
               '2012-03-27 09:30:00+00:00', '2012-03-28 09:30:00+00:00',
               '2012-03-29 09:30:00+00:00', '2012-03-30 09:30:00+00:00'],
              dtype='datetime64[ns, UTC]', freq='D')

In [128]:
ts.tz_convert('America/New_York')

DatetimeIndex(['2012-03-21 05:30:00-04:00', '2012-03-22 05:30:00-04:00',
               '2012-03-23 05:30:00-04:00', '2012-03-24 05:30:00-04:00',
               '2012-03-25 05:30:00-04:00', '2012-03-26 05:30:00-04:00',
               '2012-03-27 05:30:00-04:00', '2012-03-28 05:30:00-04:00',
               '2012-03-29 05:30:00-04:00', '2012-03-30 05:30:00-04:00'],
              dtype='datetime64[ns, America/New_York]', freq='D')

In [129]:
ts.tz_convert('Asia/Seoul')

DatetimeIndex(['2012-03-21 18:30:00+09:00', '2012-03-22 18:30:00+09:00',
               '2012-03-23 18:30:00+09:00', '2012-03-24 18:30:00+09:00',
               '2012-03-25 18:30:00+09:00', '2012-03-26 18:30:00+09:00',
               '2012-03-27 18:30:00+09:00', '2012-03-28 18:30:00+09:00',
               '2012-03-29 18:30:00+09:00', '2012-03-30 18:30:00+09:00'],
              dtype='datetime64[ns, Asia/Seoul]', freq='D')

In [9]:
values = pd.Series(['apple', 'orange', 'apple', 'apple'] * 2) 
values

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
dtype: object

In [10]:
values.unique()

array(['apple', 'orange'], dtype=object)

In [11]:
values = values.astype('category')
values

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
dtype: category
Categories (2, object): ['apple', 'orange']

# 고급 pandas

In [13]:
fruits = ['apple', 'orange', 'apple', 'apple'] * 2
N = len(fruits)
N

8

In [14]:
df = pd.DataFrame({'fruit': fruits, 'basket_id': np.arange(N), 'count': np.random.randint(3, 15, size=N)}) 
df

    fruit  basket_id  count
0   apple          0     10
1  orange          1     14
2   apple          2      7
3   apple          3     14
4   apple          4     13
5  orange          5     12
6   apple          6     13
7   apple          7      8

In [20]:
df['fruit'] = df['fruit'].astype('category')
df

    fruit  basket_id  count
0   apple          0     10
1  orange          1     14
2   apple          2      7
3   apple          3     14
4   apple          4     13
5  orange          5     12
6   apple          6     13
7   apple          7      8

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   fruit      8 non-null      category
 1   basket_id  8 non-null      int32
 2   count      8 non-null      int32
dtypes: category(1), int32(2)
memory usage: 324.0 bytes

In [25]:
df['fruit'].values

['apple', 'orange', 'apple', 'apple', 'apple', 'orange', 'apple', 'apple']
Categories (2, object): ['apple', 'orange']

In [26]:
df['fruit'].values.codes

array([0, 1, 0, 0, 0, 1, 0, 0], dtype=int8)

In [27]:
df['fruit'].values.categories

Index(['apple', 'orange'], dtype='object')

In [30]:
codes = [0,1,2,0,0,1]
categories = ['A','B','C']
cats = pd.Categorical.from_codes(codes,categories)
cats

['A', 'B', 'C', 'A', 'A', 'B']
Categories (3, object): ['A', 'B', 'C']